## Pandas

In [2]:
import pandas as pd

In [16]:
data1=pd.read_csv("/home/saurabh/Salary.csv",header=0)

In [20]:
data1.head()

   YearsExp   Salary
0       1.1  39484.0
1       1.3  46574.0
2       1.5  56777.0
3       1.8  49484.0
4       1.9  66574.0

In [26]:
data1.head(10);

In [25]:
data1

   YearsExp   Salary
0       1.1  39484.0
1       1.3  46574.0
2       1.5  56777.0
3       1.8  49484.0
4       1.9  66574.0
5       1.6  56777.0

In [31]:
data2=pd.read_csv("/home/saurabh/Salary.csv",header=0,index_col=0)

In [32]:
data2

           Salary
YearsExp
1.1       39484.0
1.3       46574.0
1.5       56777.0
1.8       49484.0
1.9       66574.0
1.6       56777.0

In [11]:
data1.describe()

       YearsExp        Salary
count  6.000000      6.000000
mean   1.366667  52611.666667
std    0.175119   9468.031531
min    1.100000  39484.000000
25%    1.300000  47301.500000
50%    1.350000  53130.500000
75%    1.475000  56777.000000
max    1.600000  66574.000000

In [13]:
data1.iloc[0]

YearsExp        1.1
Salary      39484.0
Name: 0, dtype: float64

In [34]:
data2.loc[1.1]

Salary    39484.0
Name: 1.1, dtype: float64

In [35]:
data2.iloc[0:4]

           Salary
YearsExp
1.1       39484.0
1.3       46574.0
1.5       56777.0
1.8       49484.0